illegal-argument-request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:gs="http://demo/spring/error-hanlder">
    <soapenv:Header/>
    <soapenv:Body>
        <gs:getOrderRequest>
            <gs:id></gs:id>
        </gs:getOrderRequest>
    </soapenv:Body>
</soapenv:Envelope>